# 6001
# python 언어에서 가장 기본적인 명령이 출력문이다.
# print( )를 이용해 다음 단어를 출력하시오.

# Hello

# 참고
# 아래와 같은 소스 코드를 작성하고 실행시키면,
# 지정한 "문장"이 출력(print)된다.
# print("문장")
print("Hello")

# 6002
# 이번에는 공백( )을 포함한 문장을 출력한다.
# 다음 문장을 출력해보자.

# Hello World
# (대소문자에 주의한다.)

# 참고
# print("문장1 문장2")
# 을 실행시키면 "문장1”, "문장2"가 공백( )을 사이에 두고 출력된다.
# print("문장1", "문장2")
# 도 "문장1"과 "문장2" 사이에 공백( )을 출력한다.
print("Hello World")
# = print("Hello", "World")

#6003
# 이번에는 줄을 바꿔 출력하는 출력문을 연습해보자.
# 다음과 같이 줄을 바꿔 출력해야 한다.

# Hello
# World
# (두 줄에 걸쳐 줄을 바꿔 출력)

# 예시 
# print("Hello") 
# print("World")

# 참고
# python의 기본 print( ) 를 이용해 출력하면 문장을 출력한 후 마지막에 줄을 바꾼다.(new line)
# 출력 후 줄을 바꾸는 대신 스페이스( ) 공백을 붙이도록 설정하는 방법도 있다.
print("Hello")
print("World")

#6004
# 이번에는 작은 따옴표(')(single quotation mark)가 들어있는
# 출력문 연습을 해보자.

# 다음 문장을 출력하시오.

# 'Hello'

# 예시
# print(" ' ");
print("'Hello'")

#6005
# 이번에는 큰따옴표(")(double quotation mark)가 포함된 출력문을 연습해보자.

# 다음 문장을 출력하시오.

# "Hello World"
# (단, 큰따옴표도 함께 출력한다.)

# 예시
# print(' " ');

# 참고
# python 언어에서 print( ) 로 출력할 문장을 표현할 때 큰 따옴표 기호(")로 묶어 표현한다. 
# 따라서, 큰따옴표 기호 그 자체를 출력하기 위해서는 다른 방법을 사용해야한다.
# python 언어에서 문장(문자열)을 표현하는 기호로 "와 '를 쌍으로 묶어 사용할 수 있다.
# 따라서, 문장을 표현할 때 사용하는 큰따옴표("문장") 기호 대신 작은따옴표('문장')를 사용하면 큰따옴표를 출력할 수 있다.
# (물론, 큰따옴표를 출력하는 다른 방법도 있다.)
print(ds) 